# Operations

There are lots of operations with pandas that will be really useful to you, but don't fall into any distinct category. Let's show them here in this lecture:

In [1]:
import numpy as np
import pandas as pd

In [14]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

### Info on Unique Values

In [4]:
df['col2'].unique() #Finding unique values

array([444, 555, 666], dtype=int64)

In [5]:
len(df['col2'].unique()) #To get number of unique values

3

In [6]:
#Or to get number of unique values you can also use built-in function like below:

In [7]:
df['col2'].nunique()

3

In [4]:
df['col2'].value_counts() #Shows how many time each value occurs in the column

444    2
555    1
666    1
Name: col2, dtype: int64

### Selecting Data

In [10]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [16]:
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [5]:
df['col1']>2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

### Applying Functions

In [18]:
def times2(x):
    return x*2

In [19]:
df['col1'].sum() #Applying built-in functions to pandas DataFrame

10

In [20]:
df['col1'].apply(times2) #Applying your own functions to pandas DataFrame

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [22]:
df['col3'].apply(len) #Also some built-in functions can be used in the similar way

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [23]:
#Applying lambda expressions instead of functions so it becomes simple
df['col2'].apply(lambda x: x*2) r

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [24]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [6]:
df.drop('col1',axis=1) #To drop a column

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

** Permanently Removing a Column**

In [26]:
df.drop('col1',axis=1,inplace=True) #To make sure that drop of a column takes inplace

** Get column and index names: **

In [7]:
df.columns #To get the list of column names in DataFrame

Index(['col1', 'col2', 'col3'], dtype='object')

In [8]:
'''
To get the list of row names in DataFrame. 
s rows are number indexed thus it will show start=0,stop=1,step=1
'''
df.index

RangeIndex(start=0, stop=4, step=1)

** Sorting and Ordering a DataFrame:**

In [9]:
#sort dataframe by column2. Note at the row indexes how they stay attached to each data
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

** Find Null Values or Check for Null Values**

In [10]:
df.isnull() #To get null values in the dataset. will return booleans

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

** Filling in NaN values with something else: **

In [11]:
import numpy as np

In [12]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [13]:
df.fillna('FILL')

   col1  col2 col3
0     1  FILL  abc
1     2   555  def
2     3   666  ghi
3  FILL   444  xyz

### Pivot Table

In [17]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [18]:
df #New dataframe

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [19]:
'''
We'll get the values of D, indexed/grouped by columns A and B, 
and the columns are defined for values if C which is 'x' and 'y'
'''
df.pivot_table(values='D',index=['A','B'],columns='C')

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN